In [108]:
import pandas as pd

In [16]:
pip install mysql.connector#connector between sql and python for mysql

Collecting mysql.connectorNote: you may need to restart the kernel to use updated packages.
  Downloading mysql-connector-2.2.9.tar.gz (11.9 MB)
     --------------------------------------- 11.9/11.9 MB 23.3 MB/s eta 0:00:00
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Building wheels for collected packages: mysql.connector
  Building wheel for mysql.connector (setup.py): started
  Building wheel for mysql.connector (setup.py): finished with status 'done'
  Created wheel for mysql.connector: filename=mysql_connector-2.2.9-cp38-cp38-win_amd64.whl size=247947 sha256=80c9ce5c339d0a9f243b5828a1d30dab8d59bd2253c432af277e4482dd87b6f8
  Stored in directory: c:\users\sweta\appdata\local\pip\cache\wheels\57\e4\98\5feafb5c393dd2540e44b064a6f95832990d543e5b4f53ea8f
Successfully built mysql.connector
Installing collected packages: mysql.connector
Successfully installed mysql.connector-2.2.9

WARNING: Ignoring invalid distribution -ygments (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -ygments (c:\programdata\anaconda3\lib\site-packages)

In [107]:
import sqlalchemy

In [106]:
from sqlalchemy import create_engine#importing library for creating a connection

In [105]:
conn_sql=create_engine('mysql+pymysql://root:rahul@localhost/youtube')#connection between sql and python

In [21]:
df = pd.read_csv('agg_trans.csv')

In [109]:
from pymysql import connect

In [52]:
pip install pymysql

Requirement already satisfied: pymysql in c:\programdata\anaconda3\lib\site-packages (1.0.3)
Note: you may need to restart the kernel to use updated packages.

WARNING: Ignoring invalid distribution - (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lick (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -ygments (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -ick (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution - (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -lick (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -ygments (c:\programdata\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -ick (c:\programdata\anaconda3\lib\site-packages)

In [34]:
df.to_sql(name='agg_trans',
            con=conn_sql,
            index=False,
            if_exists='append')#sending the data to sql of Aggregate transaction using pandas

In [36]:
df1=pd.read_csv('agg_user.csv')

In [37]:
df1.to_sql(name='agg_user',
            con=conn_sql,
            index=False,
            if_exists='append')##sending the data to sql of Aggregate user using pandas

In [39]:
query='''select SUM(Transacion_count) as Transaction_count,SUM(Transacion_amount) as Transaction_amount,Transacion_type as Transaction_type from agg_trans group by Transacion_type '''
pf=pd.read_sql_query(query,conn_sql)
pf

   Transaction_count  Transaction_amount          Transaction_type
0       2.909136e+10        9.726076e+13     Peer-to-peer payments
1       3.312635e+10        1.923232e+13         Merchant payments
2       9.241133e+09        4.748767e+12  Recharge & bill payments
3       7.114078e+07        4.951071e+10        Financial Services
4       1.937380e+08        1.145732e+11                    Others

In [53]:
df2=pd.read_csv('map_tran.csv')
df3=pd.read_csv('map_user.csv')

In [68]:
df2 = df2.replace('district','', regex=True)#replacig the district word

In [70]:
df2.head()

,State,Year,Quater,Transaction_amount,Transaction_count,Dist_Name
0,punjab,2021,2,4.284725e+08,199137,shahid bhagat singh nagar
1,punjab,2021,2,2.840374e+09,1140866,fazilka
2,punjab,2021,2,6.829136e+08,260490,barnala
3,punjab,2021,2,8.424558e+08,299561,mansa
4,punjab,2021,2,2.353047e+10,11475061,ludhiana

In [71]:
df2.dtypes

State                  object
Year                    int64
Quater                  int64
Transaction_amount    float64
Transaction_count       int64
Dist_Name              object
dtype: object

In [72]:
df2.to_sql(name='map_trans',
            con=conn_sql,
            index=False,
            if_exists='append')#sending the data to sql of Map transaction using pandas

In [73]:
df3.head()

,State,Year,Quater,app_open_count,user_count,District
0,punjab,2021,2,1146382,67197,shahid bhagat singh nagar district
1,punjab,2021,2,5712760,265874,fazilka district
2,punjab,2021,2,1547066,85341,barnala district
3,punjab,2021,2,1913079,115045,mansa district
4,punjab,2021,2,12949093,1204126,ludhiana district

In [76]:
df3 = df3.replace('district','', regex=True)

In [77]:
df3

,State,Year,Quater,app_open_count,user_count,District
0,punjab,2021,2,1146382,67197,shahid bhagat singh nagar
1,punjab,2021,2,5712760,265874,fazilka
2,punjab,2021,2,1547066,85341,barnala
3,punjab,2021,2,1913079,115045,mansa
4,punjab,2021,2,12949093,1204126,ludhiana
...,...,...,...,...,...,...
14635,uttar-pradesh,2022,1,7913289,228510,kannauj
14636,uttar-pradesh,2022,1,8513681,666213,azamgarh
14637,uttar-pradesh,2022,1,7593013,426442,ayodhya
14638,uttar-pradesh,2022,1,5830458,563817,deoria
14639,uttar-pradesh,2022,1,11991935,2298103,ghaziabad

In [78]:
df3.to_sql(name='map_user',
            con=conn_sql,
            index=False,
            if_exists='append')#sending the data to sql of Map user using pandas

In [79]:
df4=pd.read_csv('top_user_distname.csv')
df5=pd.read_csv('top_tran_distname.csv')
df6=pd.read_csv('top_user_pincode.csv')

In [80]:
df4.head()

    State  Year  Quater  Top_Dist_users Top_Dist_Name
0  punjab  2021       2         1204126      ludhiana
1  punjab  2021       2          675022     sas nagar
2  punjab  2021       2          489463      amritsar
3  punjab  2021       2          459789     jalandhar
4  punjab  2021       2          452152       patiala

In [83]:
df4.dtypes

State             object
Year               int64
Quater             int64
Top_Dist_users     int64
Top_Dist_Name     object
dtype: object

In [84]:
df4.to_sql(name='user_distname',
            con=conn_sql,
            index=False,
            if_exists='append')#sending the data to sql of User from top districts of a state using pandas

In [87]:
df5.to_sql(name='tran_distname',
            con=conn_sql,
            index=False,
            if_exists='append')

In [90]:
df6.head()

    State  Year  Quater  Top_Dist_users  Top_Dist_Pincode
0  punjab  2021       2          313340            143001
1  punjab  2021       2          172469            141008
2  punjab  2021       2          105913            141001
3  punjab  2021       2           99727            147001
4  punjab  2021       2           99698            140603

In [91]:
df6.to_sql(name='user_pincode',
            con=conn_sql,
            index=False,
            if_exists='append')#sending the data to sql of User from top districts of a state using pandas its pincodes

In [101]:
df8=pd.read_csv('top_tran_pincodee.csv')

In [102]:
df8.dtypes

State                  object
Year                    int64
Quater                  int64
Transaction_amount    float64
Transaction_count       int64
Top_Dist_Pincode        int64
dtype: object

In [104]:
df8.to_sql(name='tran_pincode',
            con=conn_sql,
            index=False,
            if_exists='append')#sending the data to sql of Transaction from top districts of a state using pandas of pincodes

In [126]:
vf=pd.read_csv('map_tran.csv')

In [127]:
vf["State"]=vf["State"].str.capitalize()
vf = vf.replace('-',' ', regex=True)
vf['State'] = vf['State'].str.replace('Jammu & kashmir','Jammu & Kashmir')
vf['State'] = vf['State'].str.replace('Uttar pradesh','Uttar Pradesh')
vf['State'] = vf['State'].str.replace('Himachal pradesh','Himachal Pradesh')
vf['State'] = vf['State'].str.replace('Tamil nadu','Tamil Nadu')
vf['State'] = vf['State'].str.replace('Andhra pradesh','Andhra Pradesh')
vf['State'] = vf['State'].str.replace('Andaman & nicobar islands','Andaman & Nicobar')
vf['State'] = vf['State'].str.replace('Dadra & nagar haveli & daman & diu','Dadra and Nagar Haveli and Daman and Diu')
vf['State'] = vf['State'].str.replace('Arunachal pradesh','Arunanchal Pradesh')
vf['State'] = vf['State'].str.replace('Madhya pradesh','Madhya Pradesh')
vf['State'] = vf['State'].str.replace('West bengal','West Bengal')

In [128]:
state_groups = {
        'Northern Region': ['Jammu & Kashmir', 'Himachal Pradesh', 'Punjab', 'Chandigarh', 'Uttarakhand', 'Ladakh', 'Delhi', 'Haryana'],
        'Central Region': ['Uttar Pradesh', 'Madhya Pradesh', 'Chhattisgarh'],
        'Western Region': ['Rajasthan', 'Gujarat', 'Dadra and Nagar Haveli and Daman and Diu', 'Maharashtra'],
        'Eastern Region': ['Bihar', 'Jharkhand', 'Odisha', 'West Bengal', 'Sikkim'],
        'Southern Region': ['Andhra Pradesh', 'Telangana', 'Karnataka', 'Kerala', 'Tamil Nadu', 'Puducherry', 'Goa', 'Lakshadweep', 'Andaman & Nicobar'],
        'North-Eastern Region': ['Assam', 'Meghalaya', 'Manipur', 'Nagaland', 'Tripura', 'Arunachal Pradesh', 'Mizoram']
    }
    
vf['Region'] = vf['State'].map({state: region for region, states in state_groups.items() for state in states})

In [129]:
vf.head()

,State,Year,Quater,Transaction_amount,Transaction_count,Dist_Name,Region
0,Punjab,2021,2,4.284725e+08,199137,shahid bhagat singh nagar district,Northern Region
1,Punjab,2021,2,2.840374e+09,1140866,fazilka district,Northern Region
2,Punjab,2021,2,6.829136e+08,260490,barnala district,Northern Region
3,Punjab,2021,2,8.424558e+08,299561,mansa district,Northern Region
4,Punjab,2021,2,2.353047e+10,11475061,ludhiana district,Northern Region

In [130]:
vf.dtypes

State                  object
Year                    int64
Quater                  int64
Transaction_amount    float64
Transaction_count       int64
Dist_Name              object
Region                 object
dtype: object

In [131]:
vf.isnull().sum()

State                   0
Year                    0
Quater                  0
Transaction_amount      0
Transaction_count       0
Dist_Name               0
Region                496
dtype: int64

In [132]:
vf.shape

(14636, 7)

In [134]:
vf.dropna(subset = ['State', 'Year','Quater','Transaction_amount','Transaction_amount','Dist_Name','Region'], inplace=True)

In [135]:
vf.shape

(14140, 7)

In [136]:
vf.to_sql(name='map_transs',
            con=conn_sql,
            index=False,
            if_exists='append')

In [137]:
vf=pd.read_csv('map_user.csv')

In [138]:
vf["State"]=vf["State"].str.capitalize()
vf = vf.replace('-',' ', regex=True)
vf['State'] = vf['State'].str.replace('Jammu & kashmir','Jammu & Kashmir')
vf['State'] = vf['State'].str.replace('Uttar pradesh','Uttar Pradesh')
vf['State'] = vf['State'].str.replace('Himachal pradesh','Himachal Pradesh')
vf['State'] = vf['State'].str.replace('Tamil nadu','Tamil Nadu')
vf['State'] = vf['State'].str.replace('Andhra pradesh','Andhra Pradesh')
vf['State'] = vf['State'].str.replace('Andaman & nicobar islands','Andaman & Nicobar')
vf['State'] = vf['State'].str.replace('Dadra & nagar haveli & daman & diu','Dadra and Nagar Haveli and Daman and Diu')
vf['State'] = vf['State'].str.replace('Arunachal pradesh','Arunanchal Pradesh')
vf['State'] = vf['State'].str.replace('Madhya pradesh','Madhya Pradesh')
vf['State'] = vf['State'].str.replace('West bengal','West Bengal')

In [139]:
state_groups = {
        'Northern Region': ['Jammu & Kashmir', 'Himachal Pradesh', 'Punjab', 'Chandigarh', 'Uttarakhand', 'Ladakh', 'Delhi', 'Haryana'],
        'Central Region': ['Uttar Pradesh', 'Madhya Pradesh', 'Chhattisgarh'],
        'Western Region': ['Rajasthan', 'Gujarat', 'Dadra and Nagar Haveli and Daman and Diu', 'Maharashtra'],
        'Eastern Region': ['Bihar', 'Jharkhand', 'Odisha', 'West Bengal', 'Sikkim'],
        'Southern Region': ['Andhra Pradesh', 'Telangana', 'Karnataka', 'Kerala', 'Tamil Nadu', 'Puducherry', 'Goa', 'Lakshadweep', 'Andaman & Nicobar'],
        'North-Eastern Region': ['Assam', 'Meghalaya', 'Manipur', 'Nagaland', 'Tripura', 'Arunachal Pradesh', 'Mizoram']
    }
    
vf['Region'] = vf['State'].map({state: region for region, states in state_groups.items() for state in states})

In [140]:
vf.head()

,State,Year,Quater,app_open_count,user_count,District,Region
0,Punjab,2021,2,1146382,67197,shahid bhagat singh nagar district,Northern Region
1,Punjab,2021,2,5712760,265874,fazilka district,Northern Region
2,Punjab,2021,2,1547066,85341,barnala district,Northern Region
3,Punjab,2021,2,1913079,115045,mansa district,Northern Region
4,Punjab,2021,2,12949093,1204126,ludhiana district,Northern Region

In [141]:
vf.isnull().sum()

State               0
Year                0
Quater              0
app_open_count      0
user_count          0
District            0
Region            500
dtype: int64

In [142]:
vf.dropna(subset = ['State', 'Year','Quater','app_open_count','user_count','District','Region'], inplace=True)

In [143]:
vf.shape

(14140, 7)

In [144]:
vf.dtypes

State             object
Year               int64
Quater             int64
app_open_count     int64
user_count         int64
District          object
Region            object
dtype: object

In [145]:
vf.to_sql(name='map_userss',
            con=conn_sql,
            index=False,
            if_exists='append')